src/DataProcessors/ИС_ЯМ_ВыгрузкаКарточекТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_ЯМ_ВыгрузкаКарточекТоваров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИС_ЯМ_СоответствиеЗначенийХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_ЯМ_СоответствиеЗначенийХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРеквизита1С</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_Ozon_ВидРеквизитаСопоставления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Реквизит1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_ЗначенияЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаЯМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Характеристика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристикиЯМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_ЗначенияХарактеристик</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_Ozon_ВидРеквизитаСопоставления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_Ozon_ВидРеквизитаСопоставления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитХарактеристикиНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСвойствоНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитХарактеристикиНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШтрихкодНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ИС_ЯМ_ВыгрузкаКарточекТоваров/Forms/ФормаСопоставленияЗначений/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Категория", Категория);
	Параметры.Свойство("ХарактеристикаЯМ", ХарактеристикаЯМ);
	Параметры.Свойство("ВидРеквизита1С", ВидРеквизита1С);
	Параметры.Свойство("Реквизит1С", Реквизит1С);
	Параметры.Свойство("НаборЗначений", НаборЗначений);
	Параметры.Свойство("ЕдИзм", ЕдиницаИзмерения);

	ЗаполнитьСопоставлениеПоХарактеристике();

	Если НаборЗначений Тогда
		Элементы.СопоставленниеЗначенийЗначениеХарактеристикиЯМ.ОграничениеТипа	 = Новый ОписаниеТипов("СписокЗначений");
	Иначе
		Элементы.СопоставленниеЗначенийЗначениеХарактеристикиЯМ.ОграничениеТипа	 = Новый ОписаниеТипов("Строка", ,
			Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная));
		МассивСвязей = Новый Массив;
		НоваяСвязь = Новый СвязьПараметраВыбора("Характеристика", "ХарактеристикаЯМ");
		МассивСвязей.Добавить(НоваяСвязь);
		НоваяСвязь = Новый СвязьПараметраВыбора("Категория", "Категория");
		МассивСвязей.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(МассивСвязей);
		Элементы.СопоставленниеЗначенийЗначениеХарактеристикиЯМ.СвязиПараметровВыбора = НовыеСвязи;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСопоставленныеЗначения

&НаКлиенте
Процедура СопоставленныеЗначенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СопоставленниеЗначенийЗначениеХарактеристикиЯМНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;

	СтруктураПараметров = Новый Структура;	
	СтруктураПараметров.Вставить("ХарактеристикаЯМ", ХарактеристикаЯМ);
	СтруктураПараметров.Вставить("Категория", Категория);

	Если НаборЗначений Тогда

		ТекущаяСтрока = Элементы.СопоставленныеЗначения.ТекущиеДанные;
		Если ТипЗнч(ТекущаяСтрока.ЗначениеХарактеристикиЯМ) = Тип("СписокЗначений") Тогда
			ВыбранныеЗначения = ТекущаяСтрока.ЗначениеХарактеристикиЯМ.ВыгрузитьЗначения();
		Иначе
			ВыбранныеЗначения = Новый Массив;
			Если ЗначениеЗаполнено(ТекущаяСтрока.ЗначениеХарактеристикиЯМ) Тогда
				ВыбранныеЗначения.Добавить(ТекущаяСтрока.ЗначениеХарактеристикиЯМ);
			КонецЕсли;
			ТекущаяСтрока.ЗначениеХарактеристикиЯМ = Новый СписокЗначений;
		КонецЕсли;

		СтруктураПараметров.Вставить("ВыбранныеЗначения", ВыбранныеЗначения);

		ОткрытьФорму("Обработка.ИС_ЯМ_ВыгрузкаКарточекТоваров.Форма.ФормаМножественногоВыбораАтрибута", СтруктураПараметров, Элемент, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	Иначе

		ОткрытьФорму("Справочник.ИС_ЯМ_ЗначенияХарактеристик.ФормаВыбора", СтруктураПараметров, Элемент, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

		КонецЕсли;  
		
КонецПроцедуры

&НаКлиенте
Процедура СопоставленниеЗначенийЗначениеХарактеристикиЯМОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.СопоставленныеЗначения.ТекущиеДанные;

	СтандартнаяОбработка = Ложь;
	Если НаборЗначений Тогда
		ТекущаяСтрока.ЗначениеХарактеристикиЯМ.ЗагрузитьЗначения(ВыбранноеЗначение);
	Иначе
		ТекущаяСтрока.ЗначениеХарактеристикиЯМ = ВыбранноеЗначение;
	КонецЕсли;   
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СопоставитьАвтоматически(Команда)

	СопоставитьАвтоматическиНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СопоставитьПодобные(Команда)
	СопоставитьАвтоматическиНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)

	СохранитьНаСервере();
	Закрыть();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СопоставитьАвтоматическиНаСервере(ПолноеСоответствие = Истина)

	Если ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры Тогда

		СтандартныеРеквизиты = Метаданные.Справочники["Номенклатура"].СтандартныеРеквизиты;
		Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
			Если Реквизит.Имя = Реквизит1С Тогда
				ИмяРеквизита = Реквизит.Имя;
				ТипРеквизита = Реквизит.Тип;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ИмяРеквизита = Неопределено Тогда
			РеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].Реквизиты;
			Для Каждого Реквизит Из РеквизитыНоменклатуры Цикл
				Если Реквизит.Синоним = Реквизит1С Тогда
					ТипРеквизита = Реквизит.Тип;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры Тогда

		СтандартныеРеквизиты = Метаданные.Справочники["ХарактеристикиНоменклатуры"].СтандартныеРеквизиты;
		Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
			Если Реквизит.Имя = Реквизит1С Тогда
				ИмяРеквизита = Реквизит.Имя;
				ТипРеквизита = Реквизит.Тип;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ИмяРеквизита = Неопределено Тогда
			РеквизитыХарактеристики = Метаданные.Справочники["ХарактеристикиНоменклатуры"].Реквизиты;
			Для Каждого Реквизит Из РеквизитыХарактеристики Цикл
				Если Реквизит.Синоним = Реквизит1С Тогда
					ТипРеквизита = Реквизит.Тип;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры Тогда

		ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");

	Иначе

		ТипРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизит1С, "ТипЗначения");

	КонецЕсли;

	Если ИС_MP_ВыгрузкаКарточек.ЭтоПримитивныйТип(ТипРеквизита) Или Метаданные.Перечисления.Содержит(
		Метаданные.НайтиПоТипу(ТипРеквизита.Типы()[0])) Тогда

		СопоставитьПоЗначениямПримитивногоТипа(ПолноеСоответствие);
	Иначе
		СопоставитьПоЗначениямСвойствОбъектов(ПолноеСоответствие);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()

	НаборЗаписей = РегистрыСведений.ИС_ЯМ_СоответствиеЗначенийХарактеристик.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.ХарактеристикаЯМ.Установить(ХарактеристикаЯМ);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	Для Каждого стр Из СопоставлениеЗначений Цикл
		Если ЗначениеЗаполнено(стр.ЗначениеХарактеристикиЯМ) Тогда

			Запись = НаборЗаписей.Добавить();
			Запись.Категория 					= Категория;
			Запись.ХарактеристикаЯМ 			= ХарактеристикаЯМ;
			Запись.ВидРеквизита1С 				= ВидРеквизита1С;
			Запись.Реквизит1С 					= Реквизит1С;
			Запись.ЕдиницаИзмерения				= ЕдиницаИзмерения;

			Если ТипЗнч(стр.ЗначениеХарактеристикиЯМ) = Тип("СписокЗначений") Тогда
				значение = ЗначенияВСтроку(стр.ЗначениеХарактеристикиЯМ.ВыгрузитьЗначения());
				Если ЗначениеЗаполнено(значение) Тогда
					Запись.ЗначениеХарактеристикиЯМ 	= значение;
				Иначе
					Продолжить;
				КонецЕсли;
			Иначе
				Запись.ЗначениеХарактеристикиЯМ 	= стр.ЗначениеХарактеристикиЯМ;
			КонецЕсли;

			Если ИС_MP_ВыгрузкаКарточек.ЭтоПримитивныйТип(ТипЗнч(стр.ЗначениеВ1С)) Тогда
				Запись.ЗначениеХарактеристики 	= стр.ЗначениеВ1С;
			Иначе
				ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(стр.ЗначениеВ1С));
				Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
					Запись.ЗначениеХарактеристики = Строка(стр.ЗначениеВ1С.УникальныйИдентификатор());
				ИначеЕсли Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
					Запись.ЗначениеХарактеристики = Перечисления[ОбъектМетаданных.Имя].Индекс(стр.ЗначениеВ1С) + 1;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;
	КонецЦикла;

	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Категория 			= Категория;
		Запись.ХарактеристикаЯМ 	= ХарактеристикаЯМ;
	КонецЕсли;

	НаборЗаписей.Записать(Истина);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСопоставлениеПоХарактеристике()

	ТаблицаСоответствий = ИС_ЯМ_Сервер.ТаблицаСоответствийЗначений(Категория, ХарактеристикаЯМ,
		ВидРеквизита1С, Реквизит1С);
	Для Каждого стр Из ТаблицаСоответствий Цикл

		НоваяСтрока = СопоставлениеЗначений.Добавить();
		НоваяСтрока.ЗначениеВ1С = стр.ЗначениеВ1С;

		Если ЗначениеЗаполнено(стр.ЗначениеХарактеристикиЯМ) Тогда

			Если НаборЗначений Тогда

				Если ТипЗнч(стр.ЗначениеХарактеристикиЯМ) = Тип("Строка") Тогда
					МассивЗначений = ИС_ЯМ_Сервер.ЗначенияХарактеристикЯМИзСтроки(
						стр.ЗначениеХарактеристикиЯМ);
				Иначе
					МассивЗначений = Новый Массив;
					МассивЗначений.Добавить(стр.ЗначениеХарактеристикиЯМ);
				КонецЕсли;

				НоваяСтрока.ЗначениеХарактеристикиЯМ = Новый СписокЗначений;
				НоваяСтрока.ЗначениеХарактеристикиЯМ.ЗагрузитьЗначения(МассивЗначений);

			Иначе

				НоваяСтрока.ЗначениеХарактеристикиЯМ = стр.ЗначениеХарактеристикиЯМ;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	СопоставлениеЗначений.Сортировать("ЗначениеВ1С");

КонецПроцедуры

&НаСервере
Процедура СопоставитьПоЗначениямПримитивногоТипа(ПолноеСоответствие)

	Если ПолноеСоответствие Тогда
		Условие = "ПО вт_СопоставленныеЗначения.ПредставлениеЗначениеВ1С = вт_ЗначенияЯМ.Наименование";
	Иначе
		Условие = "ПО вт_СопоставленныеЗначения.ПредставлениеЗначениеВ1С Подобно ""%"" + вт_ЗначенияЯМ.Наименование + ""%""
				  |	ИЛИ вт_ЗначенияЯМ.Наименование Подобно ""%"" + вт_СопоставленныеЗначения.ПредставлениеЗначениеВ1С + ""%""";
	КонецЕсли;

	ТабЗнач = СопоставлениеЗначений.Выгрузить().Скопировать();
	ТабЗнач.Колонки.Добавить("ПредставлениеЗначениеВ1С", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150,
		ДопустимаяДлина.Переменная)));

	Для Каждого стр Из ТабЗнач Цикл
		Если ТипЗнч(стр.ЗначениеВ1С) = Тип("Строка") Тогда
			стр.ПредставлениеЗначениеВ1С = стр.ЗначениеВ1С;
		Иначе
			стр.ПредставлениеЗначениеВ1С = Формат(стр.ЗначениеВ1С,
				"ЧРД=,; ЧРГ=; ЧГ=0; ДФ=dd.MM.yyyy; БЛ=false; БИ=true");
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ХарактеристикаЯМ", ХарактеристикаЯМ);	
	Запрос.УстановитьПараметр("ТабЗнач", ТабЗнач);

	Запрос.Текст = "ВЫБРАТЬ
				   |	ТабЗнач.ЗначениеВ1С КАК ЗначениеВ1С,
				   |	ТабЗнач.ПредставлениеЗначениеВ1С КАК ПредставлениеЗначениеВ1С
				   |ПОМЕСТИТЬ вт_СопоставленныеЗначения
				   |ИЗ
				   |	&ТабЗнач КАК ТабЗнач
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	ИС_ЯМ_ЗначенияХарактеристик.Наименование КАК Наименование,
				   |	ИС_ЯМ_ЗначенияХарактеристик.Ссылка КАК Ссылка
				   |ПОМЕСТИТЬ вт_ЗначенияЯМ
				   |ИЗ
				   |	Справочник.ИС_ЯМ_ЗначенияХарактеристик КАК ИС_ЯМ_ЗначенияХарактеристик
				   |ГДЕ
				   |	ИС_ЯМ_ЗначенияХарактеристик.Владелец = &ХарактеристикаЯМ  
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	вт_СопоставленныеЗначения.ЗначениеВ1С КАК ЗначениеВ1С,
				   |	вт_ЗначенияЯМ.Ссылка КАК СопоставленноеЗначениеЯМ
				   |ИЗ
				   |	вт_СопоставленныеЗначения КАК вт_СопоставленныеЗначения
				   |		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЗначенияЯМ КАК вт_ЗначенияЯМ
				   |		" + Условие;
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	СопоставлениеЗначений.Очистить();
	ПредыдущееЗначение = Неопределено;
	Пока Выборка.Следующий() Цикл

		Если ПредыдущееЗначение = Выборка.ЗначениеВ1С Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = СопоставлениеЗначений.Добавить();
		НоваяСтрока.ЗначениеВ1С = Выборка.ЗначениеВ1С;

		Если Не ЗначениеЗаполнено(Выборка.СопоставленноеЗначениеЯМ) Тогда
			Продолжить;
		КонецЕсли;

		Если НаборЗначений Тогда
			МассивЗначений = Новый Массив;
			МассивЗначений.Добавить(Выборка.СопоставленноеЗначениеЯМ);
			НоваяСтрока.ЗначениеХарактеристикиЯМ = Новый СписокЗначений;
			НоваяСтрока.ЗначениеХарактеристикиЯМ.ЗагрузитьЗначения(МассивЗначений);
		Иначе
			НоваяСтрока.ЗначениеХарактеристикиЯМ = Выборка.СопоставленноеЗначениеЯМ;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СопоставитьПоЗначениямСвойствОбъектов(ПолноеСоответствие)

	Если ПолноеСоответствие Тогда
		Условие = "ПО вт_СопоставленныеЗначения.ЗначениеВ1С.Наименование = вт_ЗначенияЯМ.Наименование";
	Иначе
		Условие = "ПО вт_СопоставленныеЗначения.ЗначениеВ1С.Наименование Подобно ""%"" + вт_ЗначенияЯМ.Наименование + ""%""
				  |	ИЛИ вт_ЗначенияЯМ.Наименование Подобно ""%"" + вт_СопоставленныеЗначения.ЗначениеВ1С.Наименование + ""%""";
	КонецЕсли;

	ТабЗнач = СопоставлениеЗначений.Выгрузить();
	Если ТабЗнач.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ТипЗначения = ТабЗнач[0].ЗначениеВ1С.Метаданные().ПолноеИмя();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ХарактеристикаЯМ", ХарактеристикаЯМ);	
	Запрос.УстановитьПараметр("ТабЗнач", ТабЗнач);
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВЫРАЗИТЬ (ТабЗнач.ЗначениеВ1С КАК " + ТипЗначения + ") КАК ЗначениеВ1С
																			|ПОМЕСТИТЬ вт_СопоставленныеЗначения
																			|ИЗ
																			|	&ТабЗнач КАК ТабЗнач
																			|;
																			|
																			|////////////////////////////////////////////////////////////////////////////////
																			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
																			|	ИС_ЯМ_ЗначенияХарактеристик.Наименование КАК Наименование,
																			|	ИС_ЯМ_ЗначенияХарактеристик.Ссылка КАК Ссылка
																			|ПОМЕСТИТЬ вт_ЗначенияЯМ
																			|ИЗ
																			|	Справочник.ИС_ЯМ_ЗначенияХарактеристик КАК ИС_ЯМ_ЗначенияХарактеристик
																			|ГДЕ
																			|	ИС_ЯМ_ЗначенияХарактеристик.Владелец = &ХарактеристикаЯМ 
																			|;
																			|
																			|////////////////////////////////////////////////////////////////////////////////
																			|ВЫБРАТЬ
																			|	вт_СопоставленныеЗначения.ЗначениеВ1С КАК ЗначениеВ1С,
																			|	вт_ЗначенияЯМ.Ссылка КАК СопоставленноеЗначениеЯМ
																			|ИЗ
																			|	вт_СопоставленныеЗначения КАК вт_СопоставленныеЗначения
																			|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЗначенияЯМ КАК вт_ЗначенияЯМ
																			|		" + Условие;
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	СопоставлениеЗначений.Очистить();
	ПредыдущееЗначение = Неопределено;
	Пока Выборка.Следующий() Цикл

		Если ПредыдущееЗначение = Выборка.ЗначениеВ1С Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = СопоставлениеЗначений.Добавить();
		НоваяСтрока.ЗначениеВ1С = Выборка.ЗначениеВ1С;

		Если Не ЗначениеЗаполнено(Выборка.СопоставленноеЗначениеЯМ) Тогда
			Продолжить;
		КонецЕсли;

		Если НаборЗначений Тогда
			МассивЗначений = Новый Массив;
			МассивЗначений.Добавить(Выборка.СопоставленноеЗначениеЯМ);
			НоваяСтрока.ЗначениеХарактеристикиЯМ = Новый СписокЗначений;
			НоваяСтрока.ЗначениеХарактеристикиЯМ.ЗагрузитьЗначения(МассивЗначений);
		Иначе
			НоваяСтрока.ЗначениеХарактеристикиЯМ = Выборка.СопоставленноеЗначениеЯМ;
		КонецЕсли;

		ПредыдущееЗначение = Выборка.Значениев1С;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ЗначенияВСтроку(МассивЗначений)

	Результат = "";
	Для Каждого значение Из МассивЗначений Цикл
		Если ЗначениеЗаполнено(значение) Тогда
			Результат = Результат + Строка(значение.УникальныйИдентификатор()) + ";";
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти
